app/controllers/books_controller.rb

INSERT INTO "books" ("author", "created_at", "price", "published_at", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["author", nil], ["created_at", "2026-01-27 02:07:27.945190"], ["price", nil], ["published_at", nil], ["title", "The Not So Great Gatsby"], ["updated_at", "2026-01-27 02:07:27.945190"]]
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

UPDATE "books" SET "author" = $1, "price" = $2, "published_at" = $3, "title" = $4, "updated_at" = $5 WHERE "books"."id" = $6  [["author", "Updated Author"], ["price", "0.0"], ["published_at", "2026-01-26 00:00:00"], ["title", "Updated Title"], ["updated_at", "2026-01-27 02:33:13.824903"], ["id", 980190962]]
---
  def update
    respond_to do |format|
      if @book.update(book_params)