app/controllers/books_controller.rb

INSERT INTO "books" ("title", "author", "price", "published_at", "created_at", "updated_at") VALUES ('boop', NULL, NULL, NULL, '2026-01-27 00:57:48.203283', '2026-01-27 00:57:48.203283') RETURNING "id"
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

UPDATE "books" SET "title" = 'boope', "updated_at" = '2026-01-27 00:57:57.053626' WHERE "books"."id" = 1
---
  def update
    respond_to do |format|
      if @book.update(book_params)

DELETE FROM "books" WHERE "books"."id" = 1
---
  def destroy
    @book.destroy!

SELECT "books".* FROM "books" WHERE "books"."id" = 1 LIMIT 1
---
  def set_book
    @book = Book.find(params.expect(:id))